Examinator/src/Catalogs/СсылкиОбъектовСУЗ/СсылкиОбъектовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СсылкиОбъектовСУЗ</name>
  <owners>Catalog.СтраницыСУЗ</owners>
  <owners>Catalog.ВопросыСУЗ</owners>
  <owners>Catalog.СводыЗнанийСУЗ</owners>
  <owners>Catalog.РесурсыСУЗ</owners>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.ТерминыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.ГлоссарииСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦелевоеОкно</name>
    <type>
      <types>EnumRef.ЦелевыеОкнаДляСсылокСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлементПодборки</name>
    <type>
      <types>CatalogRef.ЭлементыПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Якорь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Enums/ЦелевыеОкнаДляСсылокСУЗ/ЦелевыеОкнаДляСсылокСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ЦелевыеОкнаДляСсылокСУЗ</name>
  <comment>Список окон в которых могут открываться ссылки</comment>
  <enumValues>
    <name>this</name>
  </enumValues>
  <enumValues>
    <name>new</name>
  </enumValues>
  <enumValues>
    <name>main</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Catalogs/ЭлементыПодборкиСУЗ/ЭлементыПодборкиСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭлементыПодборкиСУЗ</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ПодборкиСУЗ</owners>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>CatalogRef.КлассификаторОбъектовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаНаОбъектСУЗ</name>
    <type>
      <types>CatalogRef.ФреймыСУЗ</types>
      <types>CatalogRef.ТерминыСУЗ</types>
      <types>CatalogRef.СтраницыСУЗ</types>
      <types>CatalogRef.РесурсыСУЗ</types>
      <types>CatalogRef.ФайлыСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Якорь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.ПоставщикиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВопросов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесВопроса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРедактироватьНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/Catalogs/СсылкиОбъектовСУЗ/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
    	Возврат; 
	КонецЕсли;		
	
	Если НЕ ЗначениеЗаполнено(СсылкаНаОбъектСУЗ) И НЕ ЗначениеЗаполнено(ВнешняяСсылка) Тогда
		Текст = НСтр("ru = 'Укажите объект ссылки или адрес внешней ссылки'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст,,,,Отказ);
	КонецЕсли;
	
	УстановитьЗначенияРеквизитов();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура УстановитьЗначенияРеквизитов() Экспорт
	
	Если ЗначениеЗаполнено(СсылкаНаОбъектСУЗ) Тогда
		
		ИмяСправочникаОбъекта = СсылкаНаОбъектСУЗ.Метаданные().Имя;
		
		Если НЕ ИмяСправочникаОбъекта = "ПодборкиСУЗ" Тогда
			ЭлементПодборки = Справочники.ЭлементыПодборкиСУЗ.ПустаяСсылка();	
		КонецЕсли;
		
		Если ИмяСправочникаОбъекта = "ФайлыСУЗ" Тогда
			ЦелевоеОкно = Перечисления.ЦелевыеОкнаДляСсылокСУЗ.new;
		Иначе
			Якорь = "";
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВнешняяСсылка) Тогда
		СсылкаНаОбъектСУЗ = Неопределено;
		ЦелевоеОкно = Перечисления.ЦелевыеОкнаДляСсылокСУЗ.new;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СсылкаНаОбъектСУЗ) И ЗначениеЗаполнено(ВнешняяСсылка) Тогда
		ВнешняяСсылка = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
